import aiogram
from aiogram import Bot, Dispatcher, types
from aiogram.utils import executor, markdown

from aiogram.dispatcher.filters import Text
from main import collectData
import json

bot = Bot(token = "6709206383:AAFJoDfj9WzuCATWAn1aT6QOiZXhsaiYeGw", parse_mode=types.ParseMode.HTML)
dp = Dispatcher(bot)


ukrainian_cities = [
    "Київ", "Львів", "Харків", "Одеса", "Дніпро", "Запоріжжя", "Івано-Франківськ",
    "Тернопіль", "Чернівці", "Херсон", "Полтава", "Житомир", "Вінниця", "Чернігів",
    "Суми", "Рівне", "Хмельницький", "Кропивницький", "Черкаси", "Миколаїв", "Хуст",
    "Мукачеве", "Ужгород", "Луцьк", "Ізмаїл", "Бердянськ", "Маріуполь", "Кривий Ріг",
    "Севастополь", "Сімферополь", "Івано-Франківськ", "Хмельницький", "Чернівці",
    "Краматорськ", "Мелітополь", "Жовква", "Біла Церква", "Нікополь", "Луганськ",
    "Лисичанськ", "Алчевськ", "Енергодар", "Марганець", "Павлоград", "Ірпінь", "Бровари",
    "Краматорськ", "Кременчук", "Мукачеве", "Славута", "Сміла", "Снігурівка", "Хотин", "Чортків",
    "Шостка", "Ямпіль", "Яремче", "Белз", "Берегово", "Білгород-Дністровський", "Білозерське", "Боярка",
    "Бурштин", "Василівка", "Ватутіне", "Гадяч", "Гайворон", "Геничеськ", "Глобине", "Деражня", "Долина",
    "Дубно", "Єнакієве", "Жовті Води", "Жмеринка", "Жовтневе", "Золочів", "Збараж", "Золочів", "Іршава",
    "Калуш", "Кам'янець-Подільський", "Каховка", "Кобеляки", "Красноармійськ", "Красноармійськ", "Красилів",
    "Красноперекопськ", "Кролевець", "Куп'янськ", "Курахове", "Ладижин", "Ланівці", "Лисянка", "Лозова", "Лохвиця",
    "Лубни", "Марганець", "Миргород", "Міусинськ", "Могилів-Подільський", "Молочанськ", "Новоград-Волинський",
    "Новогродівка", "Новий Буг", "Новий Розділ", "Новий Стратегічний", "Новомиргород", "Новомосковськ", "Новоселиця",
    "Новотроїцьке", "Обухів", "Острог", "Очаків", "Павлівка", "Первомайськ", "Переяслав-Хмельницький", "Першотравенськ",
    "Петрове", "Підгайці", "Пісочин", "Подільськ", "Покров", "Пологи", "Попасна", "Прилуки", "Приютівка", "Радехів",
    "Рахів", "Рені", "Ржищів", "Рожище", "Ромни", "Рубіжне", "Селидове", "Селище", "Сіверськ", "Скадовськ", "Сквира",
    "Славута", "Славутич", "Снігурівка", "Соледар", "Сокаль", "Сокиряни", "Солоне", "Соснівка", "Старобільськ", "Старокостянтинів",
    "Старый Самбір", "Сторожинець", "Стрий", "Судак", "Судова Вишня", "Суми", "Сургут", "Сутиски", "Таврійськ", "Талалаївка",
    "Тальне", "Тарасівка", "Тернопіль", "Тетіїв", "Токмак", "Томаківка", "Тростянець", "Трускавець", "Тульчин", "Турійськ",
    "Турия", "Тячів", "Ужгород", "Умань", "Устинівка", "Фастів", "Феодосія", "Харків", "Херсон", "Хмельницький", "Хоростків",
    "Хотин", "Христинівка", "Хуст", "Хутори", "Цюрупинськ", "Червоноград", "Чернівці", "Чернігів", "Чигирин", "Чоп", "Чорнобай",
    "Чугуїв", "Чуднів", "Шацьк", "Шахтарськ", "Шепетівка", "Шостка", "Шпола", "Щасливе", "Щирець", "Южне", "Южноукраїнськ", "Южне",
    "Юр'ївка", "Яготин", "Ялта", "Ямпіль", "Яремче", "Ясинувата"
]



@dp.message_handler(commands='start')
async def send_answer(message: types.Message):
    await message.answer('Введіть назву міста')


@dp.message_handler(lambda message: message.text and not message.text.startswith('/'))
async def get_weather(message: types.Message):
    city = message.text
    if city in ukrainian_cities:
        collectData(city.replace(" ", "-"))
        with open("weather_data.json") as file:
            data = json.load(file)
            card = (
                f"<b>{data[0].get('current_time')}:</b> <i>{data[0].get('current_temp')}</i>\n"
                f"Погода в місті <b>{city}</b> на тиждень:\n\n"
            )
            for day in data:
                if day.get('weather_description') == "Невелика хмарність":
                    smile = "🌤"
                elif day.get('weather_description') == "Хмарно, дощ зі снігом":
                    smile = "🌨"
                elif day.get('weather_description') == "Хмарно, мокрий сніг":
                    smile = "🌨"
                elif day.get('weather_description') == "Хмарно з проясненнями, невеликий дощ":
                    smile = "🌦"
                elif day.get('weather_description') == "Хмарно":
                    smile = "☁️"
                elif day.get('weather_description') == "Мінлива хмарність":
                    smile = "⛅️"
                else:
                    smile = ""  # Додайте цей рядок, щоб ініціалізувати smile, якщо жодна з умов не виконується.

                card += (
                    f"<b><u>📅{day.get('day')}, {day.get('date')} {day.get('month')}:</u></b>\n"
                    f"{smile}<b>Погода:</b> <i> {day.get('weather_description')}</i>\n"
                    f"🧊<b>Мін. температура:</b> <i>{day.get('min_temp')}</i>\n"
                    f"🌡<b>Макс. температура:</b> <i>{day.get('max_temp')}</i>\n\n"
                )

            await message.answer(card)

    else:
        await message.answer("Неправильна назва міста")

def main():
    executor.start_polling(dp)

if __name__ == "__main__":
    main()
